susanw1/zscript/receivers/generic-c++/zll/arm/no-os/stm32/src/main/c++/arm-no-os/udp-module/lowlevel/src/utility/w5100.h
#define __SOCKET_REGISTER8(name, address)                    \
  static inline void write##name(SOCKET _s, uint8_t _data) { \
    writeSn(_s, address, _data);                             \
  }                                                          \
  static inline uint8_t read##name(SOCKET _s) {              \
    return readSn(_s, address);                              \
  }
#define __SOCKET_REGISTER16(name, address)                   \
  static void write##name(SOCKET _s, uint16_t _data) {       \
    uint8_t buf[2];                                          \
    buf[0] = _data >> 8;                                     \
    buf[1] = _data & 0xFF;                                   \
    writeSn(_s, address, buf, 2);                            \
  }                                                          \
  static uint16_t read##name(SOCKET _s) {                    \
    uint8_t buf[2];                                          \
    readSn(_s, address, buf, 2);                             \
    return (buf[0] << 8) | buf[1];                           \
  }
#define __SOCKET_REGISTER_N(name, address, size)             \
  static uint16_t write##name(SOCKET _s, uint8_t *_buff) {   \
    return writeSn(_s, address, _buff, size);                \
  }                                                          \
  static uint16_t read##name(SOCKET _s, uint8_t *_buff) {    \
    return readSn(_s, address, _buff, size);                 \
  }

public:
    __SOCKET_REGISTER8(SnMR, 0x0000)        // Mode
    __SOCKET_REGISTER8(SnCR, 0x0001)        // Command
    __SOCKET_REGISTER8(SnIR, 0x0002)        // Interrupt
    __SOCKET_REGISTER8(SnSR, 0x0003)        // Status
    __SOCKET_REGISTER16(SnPORT, 0x0004)        // Source Port
    __SOCKET_REGISTER_N(SnDHAR, 0x0006, 6)     // Destination Hardw Addr
    __SOCKET_REGISTER_N(SnDIPR, 0x000C, 4)     // Destination IP Addr
    __SOCKET_REGISTER16(SnDPORT, 0x0010)        // Destination Port
    __SOCKET_REGISTER16(SnMSSR, 0x0012)        // Max Segment Size
    __SOCKET_REGISTER8(SnPROTO, 0x0014)        // Protocol in IP RAW Mode
    __SOCKET_REGISTER8(SnTOS, 0x0015)        // IP TOS
    __SOCKET_REGISTER8(SnTTL, 0x0016)        // IP TTL
    __SOCKET_REGISTER8(SnRX_SIZE, 0x001E)        // RX Memory Size (W5200 only)
    __SOCKET_REGISTER8(SnTX_SIZE, 0x001F)        // RX Memory Size (W5200 only)
    __SOCKET_REGISTER16(SnTX_FSR, 0x0020)        // TX Free Size
    __SOCKET_REGISTER16(SnTX_RD, 0x0022)        // TX Read Pointer
    __SOCKET_REGISTER16(SnTX_WR, 0x0024)        // TX Write Pointer
    __SOCKET_REGISTER16(SnRX_RSR, 0x0026)        // RX Free Size
    __SOCKET_REGISTER16(SnRX_RD, 0x0028)        // RX Read Pointer
    __SOCKET_REGISTER16(SnRX_WR, 0x002A)        // RX Write Pointer (supported?)

#undef __SOCKET_REGISTER8
#undef __SOCKET_REGISTER16
#undef __SOCKET_REGISTER_N

private:
    static uint8_t chip;
    static uint8_t ss_pin;
    static uint8_t softReset(void);
    static uint8_t isW5100(void);
    static uint8_t isW5200(void);
    static uint8_t isW5500(void);

public:
    static uint8_t getChip(void) {
        return chip;
    }
#ifdef ETHERNET_LARGE_BUFFERS
  static uint16_t SSIZE;
  static uint16_t SMASK;
#else
    static const uint16_t SSIZE = 2048;
    static const uint16_t SMASK = 0x07FF;
    #endif
    static uint16_t SBASE(uint8_t socknum) {
        if (chip == 51) {
            return socknum * SSIZE + 0x4000;
        } else {
            return socknum * SSIZE + 0x8000;
        }
    }
    static uint16_t RBASE(uint8_t socknum) {
        if (chip == 51) {
            return socknum * SSIZE + 0x6000;
        } else {
            return socknum * SSIZE + 0xC000;
        }
    }

    static bool hasOffsetAddressMapping(void) {
        if (chip == 55)
            return true;
        return false;
    }

private:
    #if defined(__AVR__)
	static volatile uint8_t *ss_pin_reg;
	static uint8_t ss_pin_mask;
	inline static void initSS() {
		ss_pin_reg = portOutputRegister(digitalPinToPort(ss_pin));
		ss_pin_mask = digitalPinToBitMask(ss_pin);
		pinMode(ss_pin, OUTPUT);
	}
	inline static void setSS() {
		*(ss_pin_reg) &= ~ss_pin_mask;
	}
	inline static void resetSS() {
		*(ss_pin_reg) |= ss_pin_mask;
	}
#elif defined(__MK20DX128__) || defined(__MK20DX256__) || defined(__MK66FX1M0__) || defined(__MK64FX512__)
	static volatile uint8_t *ss_pin_reg;
	inline static void initSS() {
		ss_pin_reg = portOutputRegister(ss_pin);
		pinMode(ss_pin, OUTPUT);
	}
	inline static void setSS() {
		*(ss_pin_reg+256) = 1;
	}
	inline static void resetSS() {
		*(ss_pin_reg+128) = 1;
	}
#elif defined(__MKL26Z64__)
	static volatile uint8_t *ss_pin_reg;
	static uint8_t ss_pin_mask;
	inline static void initSS() {
		ss_pin_reg = portOutputRegister(digitalPinToPort(ss_pin));
		ss_pin_mask = digitalPinToBitMask(ss_pin);
		pinMode(ss_pin, OUTPUT);
	}
	inline static void setSS() {
		*(ss_pin_reg+8) = ss_pin_mask;
	}
	inline static void resetSS() {
		*(ss_pin_reg+4) = ss_pin_mask;
	}
#elif defined(__SAM3X8E__) || defined(__SAM3A8C__) || defined(__SAM3A4C__)
	static volatile uint32_t *ss_pin_reg;
	static uint32_t ss_pin_mask;
	inline static void initSS() {
		ss_pin_reg = &(digitalPinToPort(ss_pin)->PIO_PER);
		ss_pin_mask = digitalPinToBitMask(ss_pin);
		pinMode(ss_pin, OUTPUT);
	}
	inline static void setSS() {
		*(ss_pin_reg+13) = ss_pin_mask;
	}
	inline static void resetSS() {
		*(ss_pin_reg+12) = ss_pin_mask;
	}
#elif defined(__PIC32MX__)
	static volatile uint32_t *ss_pin_reg;
	static uint32_t ss_pin_mask;
	inline static void initSS() {
		ss_pin_reg = portModeRegister(digitalPinToPort(ss_pin));
		ss_pin_mask = digitalPinToBitMask(ss_pin);
		pinMode(ss_pin, OUTPUT);
	}
	inline static void setSS() {
		*(ss_pin_reg+8+1) = ss_pin_mask;
	}
	inline static void resetSS() {
		*(ss_pin_reg+8+2) = ss_pin_mask;
	}

#elif defined(ARDUINO_ARCH_ESP8266)
	static volatile uint32_t *ss_pin_reg;
	static uint32_t ss_pin_mask;
	inline static void initSS() {
		ss_pin_reg = (volatile uint32_t*)GPO;
		ss_pin_mask = 1 << ss_pin;
		pinMode(ss_pin, OUTPUT);
	}
	inline static void setSS() {
		GPOC = ss_pin_mask;
	}
	inline static void resetSS() {
		GPOS = ss_pin_mask;
	}

