susanw1/zscript/receivers/generic-c++/zll/arm/no-os/stm32/src/main/c++/arm-no-os/udp-module/lowlevel/src/utility/w5100.h
#elif defined(__SAMD21G18A__)
	static volatile uint32_t *ss_pin_reg;
	static uint32_t ss_pin_mask;
	inline static void initSS() {
		ss_pin_reg = portModeRegister(digitalPinToPort(ss_pin));
		ss_pin_mask = digitalPinToBitMask(ss_pin);
		pinMode(ss_pin, OUTPUT);
	}
	inline static void setSS() {
		*(ss_pin_reg+5) = ss_pin_mask;
	}
	inline static void resetSS() {
		*(ss_pin_reg+6) = ss_pin_mask;
	}
#else
    inline static void initSS() {
        GpioPin<LL> nss = GpioManager<LL>::getPin(SPI_1_UDP_SS);
        nss.init();
        nss.set();
        nss.setOutputSpeed(VeryHighSpeed);
        nss.setOutputMode(PushPull);
        nss.setPullMode(NoPull);
        nss.setMode(Output);
    }
    inline static void setSS() {
        GpioManager<LL>::getPin(SPI_1_UDP_SS).reset();
    }
    inline static void resetSS() {
        GpioManager<LL>::getPin(SPI_1_UDP_SS).set();
    }
#endif
};

#endif

#ifndef UTIL_H
#define UTIL_H

#define htons(x) ( (((x)<<8)&0xFF00) | (((x)>>8)&0xFF) )
#define ntohs(x) htons(x)

#define htonl(x) ( ((x)<<24 & 0xFF000000UL) | \
                   ((x)<< 8 & 0x00FF0000UL) | \
                   ((x)>> 8 & 0x0000FF00UL) | \
                   ((x)>>24 & 0x000000FFUL) )
#define ntohl(x) htonl(x)

/*
 * Copyright 2018 Paul Stoffregen
 * Copyright (c) 2010 by Cristian Maglie <c.maglie@bug.st>
 *
 * This file is free software; you can redistribute it and/or modify
 * it under the terms of either the GNU General Public License version 2
 * or the GNU Lesser General Public License version 2.1, both as
 * published by the Free Software Foundation.
 */

#include "../Ethernet.h"
#include <arm-no-os/system/clock/SystemMilliClock.hpp>
#include "w5100.h"
#include <string.h>

/***************************************************/
/**            Default SS pin setting             **/
/***************************************************/

// If variant.h or other headers specifically define the
// default SS pin for ethernet, use it.
#if defined(PIN_SPI_SS_ETHERNET_LIB)
#define SS_PIN_DEFAULT  PIN_SPI_SS_ETHERNET_LIB

// MKR boards default to pin 5 for MKR ETH
// Pins 8-10 are MOSI/SCK/MISO on MRK, so don't use pin 10
#elif defined(USE_ARDUINO_MKR_PIN_LAYOUT) || defined(ARDUINO_SAMD_MKRZERO) || defined(ARDUINO_SAMD_MKR1000) || defined(ARDUINO_SAMD_MKRFox1200) || defined(ARDUINO_SAMD_MKRGSM1400) || defined(ARDUINO_SAMD_MKRWAN1300)
#define SS_PIN_DEFAULT  5

// For boards using AVR, assume shields with SS on pin 10
// will be used.  This allows for Arduino Mega (where
// SS is pin 53) and Arduino Leonardo (where SS is pin 17)
// to work by default with Arduino Ethernet Shield R2 & R3.
#elif defined(__AVR__)
#define SS_PIN_DEFAULT  10

// If variant.h or other headers define these names
// use them if none of the other cases match
#elif defined(PIN_SPI_SS)
#define SS_PIN_DEFAULT  PIN_SPI_SS
#elif defined(CORE_SS0_PIN)
#define SS_PIN_DEFAULT  CORE_SS0_PIN

// As a final fallback, use pin 10
#else
#define SS_PIN_DEFAULT  10
#endif

// W5100 controller instance
template<class LL>
uint8_t W5100Class<LL>::chip = 0;
template<class LL>
uint8_t W5100Class<LL>::CH_BASE_MSB;
template<class LL>
uint8_t W5100Class<LL>::ss_pin = SS_PIN_DEFAULT;
#ifdef ETHERNET_LARGE_BUFFERS
template<class LL>
uint16_t W5100Class<LL>::SSIZE = 2048;
template<class LL>
uint16_t W5100Class<LL>::SMASK = 0x07FF;
#endif
template<class LL>
W5100Class<LL> W5100;

// pointers and bitmasks for optimized SS pin
#if defined(__AVR__)
  volatile uint8_t * W5100Class::ss_pin_reg;
  uint8_t W5100Class::ss_pin_mask;
#elif defined(__MK20DX128__) || defined(__MK20DX256__) || defined(__MK66FX1M0__) || defined(__MK64FX512__)
  volatile uint8_t * W5100Class::ss_pin_reg;
#elif defined(__MKL26Z64__)
  volatile uint8_t * W5100Class::ss_pin_reg;
  uint8_t W5100Class::ss_pin_mask;
#elif defined(__SAM3X8E__) || defined(__SAM3A8C__) || defined(__SAM3A4C__)
  volatile uint32_t * W5100Class::ss_pin_reg;
  uint32_t W5100Class::ss_pin_mask;
#elif defined(__PIC32MX__)
  volatile uint32_t * W5100Class::ss_pin_reg;
  uint32_t W5100Class::ss_pin_mask;
#elif defined(ARDUINO_ARCH_ESP8266)
  volatile uint32_t * W5100Class::ss_pin_reg;
  uint32_t W5100Class::ss_pin_mask;
#elif defined(__SAMD21G18A__)
  volatile uint32_t * W5100Class::ss_pin_reg;
  uint32_t W5100Class::ss_pin_mask;
#endif

template<class LL>
uint8_t W5100Class<LL>::init(void)
        {
    static bool initialized = false;
    uint8_t i;

    if (initialized)
        return 1;

    // Many Ethernet shields have a CAT811 or similar reset chip
    // connected to W5100 or W5200 chips.  The W5200 will not work at
    // all, and may even drive its MISO pin, until given an active low
    // reset pulse!  The CAT811 has a 240 ms typical pulse length, and
    // a 400 ms worst case maximum pulse length.  MAX811 has a worst
    // case maximum 560 ms pulse length.  This delay is meant to wait
    // until the reset pulse is ended.  If your hardware has a shorter
    // reset time, this can be edited or removed.
    SystemMilliClock < LL > ::blockDelayMillis(560);
    //Serial.println("w5100 init");

    SPI<LL> .begin();
    initSS();
    resetSS();
    SPI<LL> .beginTransaction();

    // Attempt W5200 detection first, because W5200 does not properly
    // reset its SPI state when CS goes high (inactive).  Communication
    // from detecting the other chips can leave the W5200 in a state
    // where it won't recover, unless given a reset pulse.
    if (isW5200()) {
        CH_BASE_MSB = 0x40;
#ifdef ETHERNET_LARGE_BUFFERS
#if MAX_SOCK_NUM <= 1
        SSIZE = 16384;
#elif MAX_SOCK_NUM <= 2
        SSIZE = 8192;
#elif MAX_SOCK_NUM <= 4
        SSIZE = 4096;
#else
        SSIZE = 2048;
#endif
        SMASK = SSIZE - 1;
#endif
        for (i = 0; i < MAX_SOCK_NUM; i++) {
            writeSnRX_SIZE(i, SSIZE >> 10);
            writeSnTX_SIZE(i, SSIZE >> 10);
        }
        for (; i < 8; i++) {
            writeSnRX_SIZE(i, 0);
            writeSnTX_SIZE(i, 0);
        }
        // Try W5500 next.  Wiznet finally seems to have implemented
        // SPI well with this chip.  It appears to be very resilient,
        // so try it after the fragile W5200
    } else if (isW5500()) {
        CH_BASE_MSB = 0x10;
#ifdef ETHERNET_LARGE_BUFFERS
#if MAX_SOCK_NUM <= 1
        SSIZE = 16384;
#elif MAX_SOCK_NUM <= 2
        SSIZE = 8192;
#elif MAX_SOCK_NUM <= 4
        SSIZE = 4096;
#else
        SSIZE = 2048;
#endif
        SMASK = SSIZE - 1;
        for (i=0; i<MAX_SOCK_NUM; i++) {
            writeSnRX_SIZE(i, SSIZE >> 10);
            writeSnTX_SIZE(i, SSIZE >> 10);
        }
        for (; i<8; i++) {
            writeSnRX_SIZE(i, 0);
            writeSnTX_SIZE(i, 0);
        }
#endif
        // Try W5100 last.  This simple chip uses fixed 4 byte frames
        // for every 8 bit access.  Terribly inefficient, but so simple
        // it recovers from "hearing" unsuccessful W5100 or W5200
        // communication.  W5100 is also the only chip without a VERSIONR
        // register for identification, so we check this last.
    } else if (isW5100()) {
        CH_BASE_MSB = 0x04;
#ifdef ETHERNET_LARGE_BUFFERS
#if MAX_SOCK_NUM <= 1
        SSIZE = 8192;
        writeTMSR(0x03);
        writeRMSR(0x03);
#elif MAX_SOCK_NUM <= 2
        SSIZE = 4096;
        writeTMSR(0x0A);
        writeRMSR(0x0A);
#else
        SSIZE = 2048;
        writeTMSR(0x55);
        writeRMSR(0x55);
#endif
        SMASK = SSIZE - 1;
#else
        writeTMSR(0x55);
        writeRMSR(0x55);
#endif
        // No hardware seems to be present.  Or it could be a W5200
        // that's heard other SPI communication if its chip select
        // pin wasn't high when a SD card or other SPI chip was used.
    } else {
        //Serial.println("no chip :-(");
        chip = 0;
        SPI<LL> .endTransaction();
        return 0; // no known chip is responding :-(
    }
    SPI<LL> .endTransaction();
    initialized = true;
    return 1; // successful init
}

// Soft reset the Wiznet chip, by writing to its MR register reset bit

template<class LL>
uint8_t W5100Class<LL>::softReset(void)
        {
    uint16_t count = 0;

