susanw1/zscript/receivers/generic-c++/zll/arm/no-os/stm32/src/main/c++/arm-no-os/udp-module/lowlevel/src/utility/w5100.h
    //Serial.println("Wiznet soft reset");
    // write to reset bit
    writeMR(0x80);
    // then wait for soft reset to complete
    do {
        uint8_t mr = readMR();
        //Serial.print("mr=");
        //Serial.println(mr, HEX);
        if (mr == 0)
            return 1;
        SystemMilliClock < LL > ::blockDelayMillis(1);
    } while (++count < 20);
    return 0;
}

template<class LL>
uint8_t W5100Class<LL>::isW5100(void)
        {
    chip = 51;
    //Serial.println("w5100.cpp: detect W5100 chip");
    if (!softReset())
        return 0;
    writeMR(0x10);
    if (readMR() != 0x10)
        return 0;
    writeMR(0x12);
    if (readMR() != 0x12)
        return 0;
    writeMR(0x00);
    if (readMR() != 0x00)
        return 0;
    //Serial.println("chip is W5100");
    return 1;
}

template<class LL>
uint8_t W5100Class<LL>::isW5200(void)
        {
    chip = 52;
    //Serial.println("w5100.cpp: detect W5200 chip");
    if (!softReset())
        return 0;
    writeMR(0x08);
    if (readMR() != 0x08)
        return 0;
    writeMR(0x10);
    if (readMR() != 0x10)
        return 0;
    writeMR(0x00);
    if (readMR() != 0x00)
        return 0;
    int ver = readVERSIONR_W5200();
    //Serial.print("version=");
    //Serial.println(ver);
    if (ver != 3)
        return 0;
    //Serial.println("chip is W5200");
    return 1;
}

template<class LL>
uint8_t W5100Class<LL>::isW5500(void)
        {
    chip = 55;
    //Serial.println("w5100.cpp: detect W5500 chip");
    if (!softReset())
        return 0;
    writeMR(0x08);
    if (readMR() != 0x08)
        return 0;
    writeMR(0x10);
    if (readMR() != 0x10)
        return 0;
    writeMR(0x00);
    if (readMR() != 0x00)
        return 0;
    int ver = readVERSIONR_W5500();
    //Serial.print("version=");
    //Serial.println(ver);
    if (ver != 4)
        return 0;
    //Serial.println("chip is W5500");
    return 1;
}

template<class LL>
W5100Linkstatus W5100Class<LL>::getLinkStatus()
{
    uint8_t phystatus;

    if (!init())
        return UNKNOWN;
    switch (chip) {
    case 52:
        SPI<LL> .beginTransaction();
        phystatus = readPSTATUS_W5200();
        SPI<LL> .endTransaction();
        if (phystatus & 0x20)
            return LINK_ON;
        return LINK_OFF;
    case 55:
        SPI<LL> .beginTransaction();
        phystatus = readPHYCFGR_W5500();
        SPI<LL> .endTransaction();
        if (phystatus & 0x01)
            return LINK_ON;
        return LINK_OFF;
    default:
        return UNKNOWN;
    }
}

template<class LL>
uint16_t W5100Class<LL>::write(uint16_t addr, const uint8_t *buf, uint16_t len)
        {
    uint8_t cmd[8];

    if (chip == 51) {
        for (uint16_t i = 0; i < len; i++) {
            setSS();
            SPI<LL> .transfer(0xF0);
            SPI<LL> .transfer(addr >> 8);
            SPI<LL> .transfer(addr & 0xFF);
            addr++;
            SPI<LL> .transfer(buf[i]);
            resetSS();
        }
    } else if (chip == 52) {
        setSS();
        cmd[0] = addr >> 8;
        cmd[1] = addr & 0xFF;
        cmd[2] = ((len >> 8) & 0x7F) | 0x80;
        cmd[3] = len & 0xFF;
        SPI<LL> .transfer(cmd, 4);
#ifdef SPI_HAS_TRANSFER_BUF
        SPI<LL>.transfer(buf, NULL, len);
#else
        // TODO: copy 8 bytes at a time to cmd[] and block transfer
        for (uint16_t i = 0; i < len; i++) {
            SPI<LL> .transfer(buf[i]);
        }
#endif
        resetSS();
    } else { // chip == 55
        setSS();
        if (addr < 0x100) {
            // common registers 00nn
            cmd[0] = 0;
            cmd[1] = addr & 0xFF;
            cmd[2] = 0x04;
        } else if (addr < 0x8000) {
            // socket registers  10nn, 11nn, 12nn, 13nn, etc
            cmd[0] = 0;
            cmd[1] = addr & 0xFF;
            cmd[2] = ((addr >> 3) & 0xE0) | 0x0C;
        } else if (addr < 0xC000) {
            // transmit buffers  8000-87FF, 8800-8FFF, 9000-97FF, etc
            //  10## #nnn nnnn nnnn
            cmd[0] = addr >> 8;
            cmd[1] = addr & 0xFF;
#if defined(ETHERNET_LARGE_BUFFERS) && MAX_SOCK_NUM <= 1
            cmd[2] = 0x14;                       // 16K buffers
            #elif defined(ETHERNET_LARGE_BUFFERS) && MAX_SOCK_NUM <= 2
            cmd[2] = ((addr >> 8) & 0x20) | 0x14; // 8K buffers
            #elif defined(ETHERNET_LARGE_BUFFERS) && MAX_SOCK_NUM <= 4
            cmd[2] = ((addr >> 7) & 0x60) | 0x14; // 4K buffers
            #else
            cmd[2] = ((addr >> 6) & 0xE0) | 0x14; // 2K buffers
#endif
        } else {
            // receive buffers
            cmd[0] = addr >> 8;
            cmd[1] = addr & 0xFF;
#if defined(ETHERNET_LARGE_BUFFERS) && MAX_SOCK_NUM <= 1
            cmd[2] = 0x1C;                       // 16K buffers
            #elif defined(ETHERNET_LARGE_BUFFERS) && MAX_SOCK_NUM <= 2
            cmd[2] = ((addr >> 8) & 0x20) | 0x1C; // 8K buffers
            #elif defined(ETHERNET_LARGE_BUFFERS) && MAX_SOCK_NUM <= 4
            cmd[2] = ((addr >> 7) & 0x60) | 0x1C; // 4K buffers
            #else
            cmd[2] = ((addr >> 6) & 0xE0) | 0x1C; // 2K buffers
#endif
        }
        if (len <= 5) {
            for (uint8_t i = 0; i < len; i++) {
                cmd[i + 3] = buf[i];
            }
            SPI<LL> .transfer(cmd, len + 3);
        } else {
            SPI<LL> .transfer(cmd, 3);
#ifdef SPI_HAS_TRANSFER_BUF
            SPI<LL>.transfer(buf, NULL, len);
#else
            // TODO: copy 8 bytes at a time to cmd[] and block transfer
            for (uint16_t i = 0; i < len; i++) {
                SPI<LL> .transfer(buf[i]);
            }
#endif
        }
        resetSS();
    }
    return len;
}

template<class LL>
uint16_t W5100Class<LL>::read(uint16_t addr, uint8_t *buf, uint16_t len)
        {
    uint8_t cmd[4];

    if (chip == 51) {
        for (uint16_t i = 0; i < len; i++) {
            setSS();
#if 1
            SPI<LL> .transfer(0x0F);
            SPI<LL> .transfer(addr >> 8);
            SPI<LL> .transfer(addr & 0xFF);
            addr++;
            buf[i] = SPI<LL> .transfer(0);
#else
            cmd[0] = 0x0F;
            cmd[1] = addr >> 8;
            cmd[2] = addr & 0xFF;
            cmd[3] = 0;
            SPI<LL>.transfer(cmd, 4); // TODO: why doesn't this work?
            buf[i] = cmd[3];
            addr++;
            #endif
            resetSS();
        }
    } else if (chip == 52) {
        setSS();
        cmd[0] = addr >> 8;
        cmd[1] = addr & 0xFF;
        cmd[2] = (len >> 8) & 0x7F;
        cmd[3] = len & 0xFF;
        SPI<LL> .transfer(cmd, 4);
        memset(buf, 0, len);
        SPI<LL> .transfer(buf, len);
        resetSS();
    } else { // chip == 55
        setSS();
        if (addr < 0x100) {
            // common registers 00nn
            cmd[0] = 0;
            cmd[1] = addr & 0xFF;
            cmd[2] = 0x00;
        } else if (addr < 0x8000) {
            // socket registers  10nn, 11nn, 12nn, 13nn, etc
            cmd[0] = 0;
            cmd[1] = addr & 0xFF;
            cmd[2] = ((addr >> 3) & 0xE0) | 0x08;
        } else if (addr < 0xC000) {
            // transmit buffers  8000-87FF, 8800-8FFF, 9000-97FF, etc
            //  10## #nnn nnnn nnnn
            cmd[0] = addr >> 8;
            cmd[1] = addr & 0xFF;
#if defined(ETHERNET_LARGE_BUFFERS) && MAX_SOCK_NUM <= 1
            cmd[2] = 0x10;                       // 16K buffers
            #elif defined(ETHERNET_LARGE_BUFFERS) && MAX_SOCK_NUM <= 2
            cmd[2] = ((addr >> 8) & 0x20) | 0x10; // 8K buffers
            #elif defined(ETHERNET_LARGE_BUFFERS) && MAX_SOCK_NUM <= 4
            cmd[2] = ((addr >> 7) & 0x60) | 0x10; // 4K buffers
            #else
            cmd[2] = ((addr >> 6) & 0xE0) | 0x10; // 2K buffers
#endif
        } else {
            // receive buffers
            cmd[0] = addr >> 8;
            cmd[1] = addr & 0xFF;
#if defined(ETHERNET_LARGE_BUFFERS) && MAX_SOCK_NUM <= 1
            cmd[2] = 0x18;                       // 16K buffers
            #elif defined(ETHERNET_LARGE_BUFFERS) && MAX_SOCK_NUM <= 2
            cmd[2] = ((addr >> 8) & 0x20) | 0x18; // 8K buffers
            #elif defined(ETHERNET_LARGE_BUFFERS) && MAX_SOCK_NUM <= 4
            cmd[2] = ((addr >> 7) & 0x60) | 0x18; // 4K buffers
            #else
            cmd[2] = ((addr >> 6) & 0xE0) | 0x18; // 2K buffers
#endif
        }
        SPI<LL> .transfer(cmd, 3);
        memset(buf, 0, len);
        SPI<LL> .transfer(buf, len);
        resetSS();
    }
    return len;
}

template<class LL>
void W5100Class<LL>::execCmdSn(SOCKET s, SockCMD _cmd)
        {
    // Send command to socket
    writeSnCR(s, _cmd);
    // Wait for command to complete
    while (readSnCR(s))
        ;
}

template<class LL>
extern W5100Class<LL> W5100;

#endif
